The  PointCloudFilter  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  PointCloudFilter Class
  Autodesk.Revit.DB.PointClouds Namespace